src/Catalogs/уатПластиковыеКарты/уатПластиковыеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПластиковыеКарты</name>
  <comment>(уат)</comment>
  <attributes>
    <name>КемВыдана</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдана</name>
    <comment>Кому выдана</comment>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.уатТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <comment>Основная топливная карта</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.уатСтатусыТопливныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDкарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатус</name>
    <type>
      <types>EnumRef.уатСтатусыКарт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/уатПластиковыеКарты/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Основная Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатПластиковыеКарты.Основная,
		|	уатПластиковыеКарты.КомуВыдана,
		|	уатПластиковыеКарты.КемВыдана,
		|	уатПластиковыеКарты.Ссылка
		|ИЗ
		|	Справочник.уатПластиковыеКарты КАК уатПластиковыеКарты
		|ГДЕ
		|	уатПластиковыеКарты.КомуВыдана = &КомуВыдана
		|	И уатПластиковыеКарты.Основная = ИСТИНА
		|	И уатПластиковыеКарты.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
				СпрОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
				СпрОбъект.Основная = Ложь;
				СпрОбъект.Записать();
				ТекстНСТР = НСтр("en='Installed new main fuel card for ""%1"" (old main card: ""%2"")';ru='Установлена новая основная топливная карта для ""%1"" (старая основная карта: ""%2"")'");
				ТекстНСТР = СтрШаблон(ТекстНСТР, КомуВыдана, ТЗ[0].Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
